"""
Module contains the regex rules that will be used during processing text
in the preprocessor.py module.
"""
import re
from razdel.segmenters.tokenize import PUNCTS

PUNCTUATIONS = re.compile(f"[%s]" % re.escape(PUNCTS))

DOMAINS = "(com|net|org|edu|gov|mil|aero|asia|biz|cat|coop|info|int|jobs|mobi|museum|name|post|pro|tel|travel" \
          "|xxx|рф|ac|ad|ae|af|ag|ai|al|am|an|ao|aq|ar|as|at|au|aw|ax|az|ba|bb|bd|be|bf|bg|bh|bi|bj|bm|bn|bo|br|bs" \
          "|bt|bv|bw|by|bz|ca|cc|cd|cf|cg|ch|ci|ck|cl|cm|cn|co|cr|cs|cu|cv|cx|cy|cz|dd|de|dj|dk|dm|do|dz|ec|ee" \
          "|eg|eh|er|es|et|eu|fi|fj|fk|fm|fo|fr|ga|gb|gd|ge|gf|gg|gh|gi|gl|gm|gn|gp|gq|gr|gs|gt|gu|gw|gy|hk|hm" \
          "|hn|hr|ht|hu|id|ie|il|im|in|io|iq|ir|is|it|je|jm|jo|jp|ke|kg|kh|ki|km|kn|kp|kr|kw|ky|kz|la|lb|lc|li|lk" \
          "|lr|ls|lt|lu|lv|ly|ma|mc|md|me|mg|mh|mk|ml|mm|mn|mo|mp|mq|mr|ms|mt|mu|mv|mw|mx|my|mz|na|nc|ne|nf|ng|ni|nl" \
          "|no|np|nr|nu|nz|om|pa|pe|pf|pg|ph|pk|pl|pm|pn|pr|ps|pt|pw|py|qa|re|ro|rs|ru|rw|sa|sb|sc|sd|se|sg|sh|si" \
          "|sj|Ja|sk|sl|sm|sn|so|sr|ss|st|su|sv|sx|sy|sz|tc|td|tf|tg|th|tj|tk|tl|tm|tn|to|tp|tr|tt|tv|tw|tz|ua|ug" \
          "|uk|us|uy|uz|va|vc|ve|vg|vi|vn|vu|wf|ws|ye|yt|yu|za|zm|zw)"
URLS = re.compile(r"(https?://[^\s]+)|(www\.[^\s]+)|([\wа-яА-Я-]+\.{}[^\s]*)".format(DOMAINS), re.IGNORECASE)

SWORDS_LITE = ['и', 'в', 'во', 'не', 'что', 'он', 'на', 'я', 'с', 'со', 'как', 'а', 'то', 'все', 'она', 'так',
               'его', 'но', 'да', 'ты', 'к', 'у', 'же', 'вы', 'за', 'бы', 'по', 'ее', 'мне',
               'вот', 'от', 'меня', 'еще', 'нет', 'о', 'из', 'ему', 'ли', 'если', 'уже', 'или', 'ни',
               'него', 'до', 'вас', 'нибудь', 'уж', 'вам',
               'ведь', 'там', 'потом', 'себя', 'ничего', 'ей', 'они', 'тут', 'где', 'надо', 'ней',
               'для', 'мы', 'тебя', 'их', 'чем', 'сам', 'без', 'раз', 'тоже', 'себе',
               'под', 'ж', 'кто', 'этот', 'того', 'какой', 'совсем', 'ним',
               'здесь', 'этом', 'один', 'мой', 'тем', 'нее', 'куда', 'зачем',
               'всех', 'никогда', 'можно', 'при', 'два', 'об', 'другой', 'хоть', 'после', 'над', 'больше',
               'тот', 'через', 'эти', 'нас', 'про', 'всего', 'них', 'какая', 'много', 'разве', 'три', 'эту', 'моя',
               'свою', 'этой', 'это', 'перед', 'иногда', 'лучше', 'чуть', 'том', 'нельзя', 'такой',
               'им', 'всю']

SWORDS_LARGE = ["одними", "никакой", "её", "этими", "сразу", "мимо", "ж", "многочисленный",
                "нужный", "другое", "или", "о", "однако", "пора", "восемнадцать", "один", "второй", "твоя", "просто",
                "будучи", "одних", "нашем", "тем", "тысяч", "могу", "действительно", "тринадцатый", "русский", "моим",
                "год", "своем", "из", "день", "можете", "конец", "часто", "которое", "иа", "именно", "две", "те",
                "такую",
                "одну", "мои", "процентов", "которыми", "такое", "хочешь", "многочисленное", "перед", "бывает", "то",
                "важный", "моими", "недалеко", "году", "могите", "такие", "ваша", "занят", "той", "моё", "можхо",
                "посреди",
                "таком", "нх", "подойди", "та", "оба", "назад", "вдруг", "стал", "пол", "комья", "саму", "тобой",
                "этим",
                "непрерывно", "уж", "других", "том", "отсюда", "у", "одним", "моих", "никуда", "даром", "имел", "двух",
                "нашею", "когда", "моём", "самого", "в", "с", "всею", "чуть", "куда", "много", "правда", "сама",
                "какая", "должно", "четвертый", "ним", "четырнадцать", "нами", "ей", "твои", "где-то", "давно", "нашим",
                "это", "всё", "который", "чтоб", "всю", "мало", "значить", "себе", "лет", "которого", "сейчас",
                "самому",
                "будете", "везде", "почему", "мой", "девятый", "всем", "таким", "ешь", "вообще", "против", "нас",
                "свои",
                "хоть", "этому", "на", "тоже", "можешь", "значит", "миллионов", "сам", "нём", "всего", "такими",
                "нам", "между", "семнадцать", "мы", "моею", "семь", "себя", "кому", "вместе", "десятый", "свое",
                "нашими",
                "далекий", "при", "чему-то", "иди", "ему", "низко", "многочисленная", "свой", "ею", "сказала", "вдали",
                "этих", "являюсь", "тогда", "нашего", "чего", "долго", "об", "начала", "снова", "совсем",
                "менее",
                "своя", "спасибо", "наконец", "вас", "двенадцатый", "каждая", "рано", "более", "времени",
                "нужно",
                "наша", "чём", "надо", "такому", "четыре", "одною", "девятнадцать", "седьмой", "довольно",
                "четырнадцатый",
                "нашему", "раньше", "восьмой", "откуда", "сих", "одном", "наиболее", "теперь", "потом", "занята",
                "меня",
                "их", "тою", "наса", "опять", "если", "меньше", "нее", "мира", "ещё", "своём", "здесь", "ваш", "все",
                "одиннадцатый", "самый", "самих", "сначала", "кажется", "этого", "c", "моего", "ни", "ниже", "моей",
                "ее",
                "своего", "важная", "девять", "другая", "прекрасно", "пятнадцать", "всех", "я", "того", "этою",
                "последний",
                "заняты", "этом", "обычно", "чем-то", "она", "самом", "своих", "близко", "лишь", "одна", "время",
                "делаю",
                "такая", "уже", "самим", "которые", "которому", "имъ", "тот", "другие", "почти", "впрочем", "будем",
                "шестнадцатый", "затем", "сегодня", "недавно", "зато", "двенадцать", "так", "пор", "нашей", "есть",
                "сказал",
                "одной", "собою", "тому", "вон", "ней", "говорил", "внизу", "иногда", "каждое", "е", "пока", "для",
                "вот",
                "ко", "раз", "томах", "г", "хотя", "во", "шесть", "ними", "могла", "наверху", "семнадцатый", "эту",
                "только",
                "которою", "всему", "восемь", "должен", "емъ", "чему", "котором", "эти", "оне", "вверх", "имя", "выйти",
                "ну",
                "особенно", "говорит", "буду", "можем", "потому", "после", "над", "двадцатый", "которая", "меля", "где",
                "жизнь", "туда", "кого", "ту", "своей", "его", "будто", "лучше", "могло", "которым", "суть",
                "ли",
                "нередко", "ком", "также", "ведь", "делал", "иметь", "как", "многочисленные", "мной", "шестнадцать",
                "своими", "очень", "большой", "пять", "ела", "которых", "едим", "рядом", "этой", "каждый", "можно",
                "такой", "им", "книга", "будут", "мож", "такого", "что-то", "свою", "дальше", "неё", "самой",
                "эта", "кем", "вы", "шестой", "и", "т", "м", "девятнадцатый", "сколько", "могли", "слишком", "же",
                "одиннадцать", "моя", "хорошо", "могут", "одно", "нем", "нашу", "самими", "таки", "нет", "кругом",
                "само",
                "наших", "своим", "далеко", "кроме", "пятнадцатый", "наши", "ты", "ест", "делать", "к", "должный", "до",
                "однажды", "твой", "несколько", "будь", "позже", "тобою", "про", "тех", "каждые", "ничего", "имеет",
                "алло",
                "некоторый", "будешь", "видел", "немного", "твоё", "своею", "около", "чем", "первый", "них", "без",
                "отовсюду", "тринадцать", "может", "вниз", "тебе", "будьте", "чтобы", "нибудь", "важные", "еще", "ем",
                "моему", "своему", "другой", "сказать", "едят", "от", "люди", "знать", "всеми", "никогда", "они",
                "разве",
                "чаще", "десять", "хотел", "со", "через", "одного", "мое", "вся", "кто", "всегда", "никто", "мог",
                "него",
                "мне", "ваше", "этот", "пожалуйста", "сами", "теми", "восемнадцатый", "вам", "ваши", "третий", "наш",
                "дел",
                "своё", "всея", "уметь", "за", "наше", "какой", "мочь", "что", "он", "пятый", "а", "одни", "такою",
                "человек",
                "мною", "по", "вами", "моем", "двадцать", "маленький", "но", "пойти", "моги", "не", "собой",
                "хотеть",
                "нею", "таких", "два", "мор", "всюду", "дать", "которой", "больше", "тут", "весь", "под", "которую",
                "там", "вне", "будет", "нему", "зачем", "зачем-то", "важное", "оно", "три", "ничто", "всём", "конечно",
                "мою", "нельзя",
                "бы", "путь", "одному", "тебя", "ими", "даже", "всей", "да", "вокруг"]

STOPWORDS = re.compile(rf"\b({'|'.join(SWORDS_LARGE)})\b", re.IGNORECASE)
